app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO `users` (`userId`, `name`, `email`, `created_at`, `updated_at`) VALUES ('3', '2', '3', '2023-10-18 08:08:52.299393', '2023-10-18 08:08:52.299393')

  def update
    if @user.update(user_params)
---
UPDATE `users` SET `users`.`name` = '1', `users`.`email` = '3', `users`.`updated_at` = '2023-10-18 08:01:46.099750' WHERE `users`.`id` = 2